# CLI tools
brew "pipx"
brew "ollama"
brew "ocrmypdf"
brew "grok"
brew "hf"
brew "gemini-cli"
brew "openjdk"
brew "node"
brew "netbirdio/tap/netbird"
brew "git-filter-repo"
brew "ffmpeg"
brew "docker-compose"
brew "docker-buildx"
brew "docker"
brew "colima"
brew "cocoapods"
brew "keith/formulae/reminders-cli"
brew "openssl"
brew "git"
brew "gh"
brew "awscli"
brew "bash"
brew "coreutils"
brew "findutils"
brew "grep"
brew "go"
brew "lastpass-cli"
brew "mas"
brew "tmux"
brew "zsh"
brew "zsh-completions"

# Modern CLI
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "jq"
brew "starship"
brew "btop"
brew "dust"
brew "bandwhich"

# Language version managers / runtimes
brew "rbenv"
brew "ruby-build"
brew "pyenv"
brew "python@3.14"
brew "uv"
brew "fnm"

# Infra / ops
brew "kubectl"
brew "helm"
brew "k9s"
brew "ansible"

# Casks
cask "claude-usage-systray"
cask "google-drive"
cask "ollama-app"
cask "lm-studio"
cask "anythingllm"
cask "grok-build"
cask "codex"
cask "chatgpt"
cask "flutter"
cask "android-commandlinetools"
cask "alfred"
cask "caffeine"
cask "ghostty"
cask "visual-studio-code"
cask "google-chrome"
cask "handbrake-app"
cask "slack"
cask "sourcetree"
cask "sublime-text"
cask "the-unarchiver"
cask "transmission"
cask "vlc"

# Mac App Store
mas "Xcode", id: 497799835
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 361285480
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
